user-4.0/tutorials/multiPhysics/interTrackEddyCurrentFoam/rgsSimpleBlock3D/constant/edgeBiotSavartProperties.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      edgeBiotSavartProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nNonOrthogonalCorrectors    10;

inductors
{
    coil0
    {
        file       "coil0.eMesh";
        reverse    false;
        current    1414.21356237;
        filaments  1;
        phase      0.0;
    }
    
    coil1
    {
        file       "coil1.eMesh";
        reverse    false;
        current    1414.21356237;
        filaments  1;
        phase      0.0;
    }
    
    coil2
    {
        file       "coil2.eMesh";
        reverse    false;
        current    1414.21356237;
        filaments  1;
        phase      0.0;
    }
}

// ************************************************************************* //

