user-4.0/tutorials/multiPhysics/interTrackEddyCurrentFoam/rgsSimpleBlock3D/0.org/region_conductor/mur
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      sigma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    conductorSurface
    {
        type            zeroGradient;
    }
    "procBoundary.*"
    {
        type            processor;
        value           $internalField;
    }
}

// ************************************************************************* //
